Autodesk.Revit.DB.Analysis.MassZone.GetMassDataElementIdForZoneFaceReference(Autodesk.Revit.DB.Reference)
MassZone faces come from faces of MassEnergyAnalyticalModel, and those faces have MassSurfaceData
or MassLevelData elements associated with them.
Remarks:
This element will contain the properties associated with the MassEnergyAnalyticalModel face or MassLevelData
that the MassZone Face is derived from.
referenceOfZone:
Reference to face of the MassZone to get data element for.
Returns:
Id of MassSurfaceData or MassLevelData element.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input Reference is not a face Reference of this MassZone.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.Analysis.MassZone.GetCoincidentReferenceFromAdjacentZone(Autodesk.Revit.DB.Reference)
This method is used to get a Reference from an adjacent MassZone that is coincident to a Reference of this MassZone.
Remarks:
The result is always a Reference to a Face. The Reference Type should report as REFERENCE_TYPE_SURFACE.
Currently Revit improperly reports it as REFERENCE_TYPE_NONE.
The results are always references to Faces.
referenceToZoneFace:
Reference to face of MassZone.
Returns:
Reference to coincident face of adjacent MassZone or null if there is no adjacent MassZone face Reference.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input Reference is not a face Reference of this MassZone.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.Analysis.MassZone.GetEquivalentReferenceFromMassOrLevel(Autodesk.Revit.DB.Reference)
Returns a Reference to a face of a MassEnergyAnalyticalModel element or
an element Reference to a MassLevelData element.
This Reference represents what the MassZone face was "cut from" when making the MassZone for the level.
Remarks:
If the Reference is to a MassLevelData element, it means that the MassEnergyAnalyticalModel element
did not have an exterior face for this MassZone face.  For this case, the MassZone face was created
as the cross-section of the MassEnergyAnalyticalModel geometry where it was intersected by the level
of the MassLevelData.
referenceToZoneFace:
Reference to a face of the zone to get an equivalent reference for.
Returns:
Reference to MassEnergyAnalyticalModel or MassLevelData.  Should only be null if there is an error
in the MassEnergyAnalyticalModel data or the input is not a
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input Reference is not a face Reference of this MassZone.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.Analysis.MassZone.SpaceTypeId
The space type element of the MassZone.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.Analysis.MassZone.MaterialId
The visualization material for the MassZone.
Will be InvalidElementId if material is by category or the material type is by MassZoneMaterialTypeMaterialBySurfaceType.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The input element materialId is not a material element.
-or-
When setting this property: The MassZone does not have normal material type handling, so the material setting is not appropriate.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2012